import * as React from "react"
import { Link } from "gatsby"
import { StaticImage } from "gatsby-plugin-image"
import { Row, Col, Image } from "react-bootstrap"

import Layout from "../../components/layout"
import Seo from "../../components/seo"
import * as styles from "../../components/index.module.css"

import lineOrder from "../../images/lineorder.gif"

const mainPageLinks = [
  { text: "หน้าแรก", url: "/" },
  { text: "ไลฟ์เวนเทจ", url: "/lifevantage" },
  { text: "งานวิจัย", url: "/research" },
  { text: "ประสบการณ์", url: "/experience" },
  { text: "บทความ", url: "/articles" },
]

const Kidney = () => (
  <Layout>
    <div className={styles.textCenter}>
    <Seo title="LifeVantage" />
      <div className={styles.intro}>
          {mainPageLinks.map((link, i) => (
            <React.Fragment key={link.url}>
              <Link to={link.url}>{link.text}</Link>
              {i !== mainPageLinks.length - 1 && <> · </>}
            </React.Fragment>
          ))}
      </div>
      <StaticImage
        src="../../images/LFVNFullLogo.jpg"
        loading="eager"
        width={800}
        formats={["auto", "webp", "avif"]}
        alt=""
        style={{ marginBottom: `var(--space-3)` }}
      />
    </div>
    <h1 className={styles.textCenter}>จุดเริ่มต้นเล็กๆ สร้างฝันที่ยิ่งใหญ่</h1>
    <hr />
    <h2>ไต โรคไต และการดูแลไต</h2>
    <p>ไตเป็นอวัยวะรูปคล้ายถั่ว โดยปกติคนเราจะมีไต 2 ข้างอยู่ตรงบริเวณชายโครงด้านหลังบริเวณบั้นเอว ขนาดยาวประมาณ 10-12 เซนติเมตร
      ไตแต่ละข้างมีน้ำหนักประมาณ 150 กรัม ไตทั้งสองข้างเชื่อมต่อกับกระเพาะปัสสาวะด้วยท่อไต หลังจากนั้นปัสสาวะจะถูกเก็บไว้ที่กระเพาะปัสสาวะ
      เพื่อรอปัสสาวะออกผ่านทางท่อปัสสาวะ
    </p>

    <p>
      โดยคนปกติจะมีท่อไตสองข้าง แต่มีท่อปัสสาวะเพียงท่อเดียว ดังนั้น ถ้าเกิดมีนิ่วอุดที่ท่อไตข้างหนึ่ง ผู้ป่วยจะยังคงมีปัสสาวะได้ 
      เนื่องจากท่อไตอีกข้างปกตินั่นเอง แต่ถ้ามีนิ่วอุดตันที่ท่อปัสสาวะผู้ป่วยก็จะไม่มีปัสสาวะเลยนั่นเอง
    </p>
    
    
      <h3>โดยไตมีหน้าที่หลักๆ 5 อย่างด้วยกันคือ</h3>

      <h4>1. กำจัดของเสียและน้ำส่วนเกิน</h4>
    <p>
      ซึ่งของเสียที่ว่าคือสารที่เกิดจากการย่อยสลายอาหารและปฏิกิริยาเคมีในร่างกายของเรานั่นเอง จะออกมาอยู่ในรูปของสารที่ชื่อว่ายูเรียเป็นหลัก
      นอกจากนี้ยังมีสารอื่นๆ เช่น ครีเอตินิน และกรดยูริก นอกจากนั่นยังกำจัดยาและสารพิษอื่นๆ ในร่างกายได้อีกด้วย
    </p>
      <h4>2. ควบคุมสมดุลของเกลือแร่และความเป็นกรดด่างในร่างกายให้เป็นปกติ</h4>
    <p>
      โดยร่างกายเราจะมีเกลือแร่ที่สำคัญซึ่งใช้ในการทำงานของร่างกาย เกลือแร่ที่มีความสำคัญ เช่น โซเดียม โพแทสเซียม แคลเซียม และฟอสเฟต
    </p>
      <h4>3. ช่วยในการสร้างเม็ดเลือดแดง</h4>
    <p>
      หน้าที่นี้คนส่วนใหญ่ไม่ค่อยทราบกัน คือไตจะสร้างฮอร์โมนตัวหนึ่งที่ชื่ออีริโทรโพอิติน "Erythorpoietin" เพื่อช่วยสร้างเม็ดเลือดแดงที่ไขกระดูก 
      ดังนั้นบางคนที่เป็นโรคไตจะมีภาวะซีด คือเม็ดเลือดแดงน้อยกว่าปกติได้ ดังนั้น ผู้ป่วยที่เป็นโรคไตเรื้อรังที่เป็นมากแล้วจึงต้องฉีดยาฮอร์โมน Erythorpoietin ทดแทน
    </p>
      <h4>4. ช่วยกระตุ้นเปลี่ยนให้วิตามินดีเป็นรูปแบบที่ทำงานได้เต็มที่หรือแอคทีฟฟอร์ม</h4>
    <p>
      โดยปกติแล้ววิตามินดีคือ ทำหน้าที่เกี่ยวกับกระดูกและกล้ามเนื้อ แต่จะทำงานได้เต้มที่จะต้องได้รับการเติมหมู่ที่ชื่อว่าหมู่ hydroxy ที่ตำแหน่งที่ 25
      ของโมเลกุลที่ตับ และตำแหน่งที่ 1 ของโมเลกุลที่ไต กลายเป็นวิตามินดีที่พร้อมทำหน้าที่ได้เต็มที่ โดยมีชื่อเต็มคือ 1,25-dihydroxyvitamin D
      ผู้ป่วยโรคไตบางคนจึงต้องได้รับวิตามินดีเสริมในรูปแบบที่ทำงานได้เต็มที่แล้ว
    </p>
      <h4>5. ช่วยควบคุมระบบความดันโลหิต</h4>
    <p>
      โดยที่ไตจะมีเซลล์ชื่อ เจจี เซลล์ ทำหน้าที่สร้างฮอร์โมนชื่อ เรนิน และเรนินจะหลั่งมากขึ้นถ้ามีเลือดมาเลี้ยงที่ไตลดลง ฮอร์โมนเรนินที่เพิ่มขึ้นจะไปกระตุ้น
      การทำงานของระบบเรนินและแอนจิโอเทนซิน โดยรวมจะทำให้ความดันโลหิตสูงขึ้น หลอดเลือดหดตัวเพิ่มขึ้น มีการดูดกลับของเกลือแร่และน้ำที่ไต
      และเกิดการกระตุ้นการทำงานของระบบประสาทซิมพาเทติก
    </p>
    <Row>
      <Col md={{ span: 8, offset: 2}}>
        
        <h4>สอบถามผ่านไลน์...คลิก</h4> 
          <a href="https://lin.ee/PdT5d43" target="_blank" rel="noopener noreferrer">
            <StaticImage
              src="../../images/linemai.png"
              width={300}
              quality={100}
              formats={["auto", "webp", "avif"]}
              alt=""
              style={{ marginBottom: `var(--space-3)` }}
            />
          </a>
        <h3>โทร: (065) 993 2500</h3>
      </Col>
    </Row>

    {/* Line Order Image */}
      <center>
        <a href="https://lin.ee/PdT5d43" target="_blank" rel="noopener noreferrer">
          <Image
            src={lineOrder}
            alt=""
            fluid
            width={500}
          />
        </a>
      </center>
    {/* Line Order Image */}
  </Layout>
)

export default Kidney
